constant/ppProperties
/*--------------------------------*- C++ -*----------------------------------*	\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      ppProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

preAlphaExp     250;

expMax          1000;

alphaMax        0.635;

alphaMinFriction  alphaMinFriction [0 0 0 0 0 0 0 ] 0.57;

Fr              Fr [ 1 -1 -2 0 0 0 0 ] 0.05;

eta             eta [ 0 0 0 0 0 0 0 ] 3;

p               p [ 0 0 0 0 0 0 0 ] 5;

g0              g0 [ 1 -1 -2 0 0 0 0 ] 0;

packingLimiter  no;


// ************************************************************************* //
