system/funkySetFieldsDict
FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "system";
    local           "";

    class           dictionary;
    object          funkySetFieldsDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
expressions
(
  alpha
  {
    field alpha;
    keepPatches true;
    expression "0.5*0.61*(1+tanh(-840-240*pos().z))";
    condition  "(pos().x<2) && (pos().x>=-2)";
  }

  water
  {
    field alpha1;
    keepPatches true;
    expression "alpha1-alpha";
  }

  gamma
  {
    field gamma;
    keepPatches true;
    expression "1-alpha1-alpha";
  }

);
