system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues ( volScalarFieldValue alpha 0.0921 );

regions 
(
/*      boxToCell
      {
           box ( 0 0 -0.25 ) ( 1.0 0.08 0.25 ) ;
           fieldValues ( volScalarFieldValue Theta 0);
      }
      boxToCell 
      {
           box ( 0 0.3 -0.25 ) ( 1.0 0.5 0.25 ) ;
           fieldValues ( volScalarFieldValue epsilon 1e-20); 
      }
      boxToCell  
      {
           box ( 0 0.3 -0.25 ) ( 1.0 0.5 0.25 ) ;
           fieldValues ( volScalarFieldValue k 1e-20);      
      }
      boxToCell
      {
           box ( 0 0.3 -0.25 ) ( 1.0 0.5 0.25 ) ;
           fieldValues ( volScalarFieldValue Theta 1e-20);
      }     
      boxToCell
      {
           box ( 0 0.3 -0.25 ) ( 1.0 0.5 0.25 ) ;
           fieldValues ( volScalarFieldValue p 1e-20);
      }
      boxToCell
      {
           box ( 0 0 -0.25 ) ( 1.0 0.5 0.25 ) ;
           fieldValues ( volVectorFieldValue Ua (0 0 0)) ;
      }
      boxToCell
      {
           box ( 0 0 -0.25 ) ( 1.0 0.5 0.25 ) ;
           fieldValues ( volVectorFieldValue Ub (0 0 0)) ;
      }
*/
);


// ************************************************************************* //
